src/Documents/ЗакрытиеДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗакрытиеДня</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусныеСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРабочегоДня</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗакрытиеБонусныхСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Карты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закрыт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеНачисленийБонусныхСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеСчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыРабочегоДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыРабочегоДня</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<Comment>Определяет состояние рабочего дня</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
					<Comment>Определяет состояние рабочего дня</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОграниченийСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОграниченийСрокаДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бессрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокДействия_С_По</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокОграниченПериодом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БонусныеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Именной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПриОплатеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченПроцентомСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеНачисленийПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСписанияПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачисленийТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленияВДеньРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Comment>Ключ для оплаты SKLLZZ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удалить_ПакетУслугСоставУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаСегмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ЗакрытиеДня/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью" объекта
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеБезПроведения") Тогда
		Возврат;
	КонецЕсли;
		
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	// Очищает ТЧ списания дней и закрытия членства
	СписаниеНачисленийБонусныхСчетов.Очистить();
	ЗакрытиеБонусныхСчетов.Очистить();
	
	// Заполняем табличные части по которым пойдут списания
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И Проведен = Истина Тогда
			
		Если Статус = Перечисления.СтатусыРабочегоДня.Закрыт Тогда
			ЗаполнитьЗакрытиеБонусныхСчетов();
			ЗаполнитьСписаниеНачисленийБонусныхСчетов();
		КонецЕсли;
	КонецЕсли;
	
	// ПостОбработка справочника БонусныеСчета
	ЗакрытьОтменитьЗакрытиеБонусныхСчетов(РежимЗаписи);
	 
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  	
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеБезПроведения") Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения" объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.	
	Документы.ЗакрытиеДня.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.БонусныеСчета(ДополнительныеСвойства, Движения, Отказ);	
	
	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, заполняет ТЧ истекшими начислениями бонусных счетов.
//
Процедура ЗаполнитьСписаниеНачисленийБонусныхСчетов(БонусныйСчетАктуализации = Неопределено, ПериодОстатков = Неопределено)
	
	Запрос = Новый Запрос;
	Если БонусныйСчетАктуализации = Неопределено Тогда
		МассивОтборБонусныхСчетов = ЗакрытиеБонусныхСчетов.ВыгрузитьКолонку("БонусныйСчет");
	Иначе
		МассивОтборБонусныхСчетов = Новый Массив;
		МассивОтборБонусныхСчетов.Добавить(БонусныйСчетАктуализации);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка"				, Ссылка);	
	Запрос.УстановитьПараметр("МассивБонусныхСчетов", МассивОтборБонусныхСчетов);	
	Запрос.УстановитьПараметр("ДатаЗакрытияДня"		, НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())));	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусныеСчетаОстатки.ДокументНачисления КАК ДокументНачисления,
	|	БонусныеСчетаОстатки.БонусныйСчет КАК БонусныйСчет,
	|	СУММА(БонусныеСчетаОстатки.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.БонусныеСчета.Обороты(
	|			,
	|			&ПериодОстатков,
	|			Запись,
	|			БонусныйСчет В (&МассивБонусныхСчетов)
	|				ИЛИ НЕ БонусныйСчет В (&МассивБонусныхСчетов)
	|					И БонусныйСчет.ОграничениеНачисленийПоСрокуДействия <> ЗНАЧЕНИЕ(Перечисление.ТипыОграниченийСрокаДействия.Бессрочный)
	|					И ВЫБОР
	|						КОГДА БонусныйСчет.СрокДействияНачисленийТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДокументНачисления.Дата, ДЕНЬ, БонусныйСчет.СрокДействияНачислений) <= НАЧАЛОПЕРИОДА(&ДатаЗакрытияДня, ДЕНЬ)
	|						КОГДА БонусныйСчет.СрокДействияНачисленийТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДокументНачисления.Дата, МЕСЯЦ, БонусныйСчет.СрокДействияНачислений) <= НАЧАЛОПЕРИОДА(&ДатаЗакрытияДня, ДЕНЬ)
	|						КОГДА БонусныйСчет.СрокДействияНачисленийТип = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|							ТОГДА ДОБАВИТЬКДАТЕ(ДокументНачисления.Дата, ГОД, БонусныйСчет.СрокДействияНачислений) <= НАЧАЛОПЕРИОДА(&ДатаЗакрытияДня, ДЕНЬ)
	|					КОНЕЦ) КАК БонусныеСчетаОстатки
	|ГДЕ
	|	БонусныеСчетаОстатки.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БонусныеСчетаОстатки.ДокументНачисления,
	|	БонусныеСчетаОстатки.БонусныйСчет
	|
	|ИМЕЮЩИЕ
	|	СУММА(БонусныеСчетаОстатки.СуммаОборот) > 0";
	
	Если ЗначениеЗаполнено(ПериодОстатков) Тогда 
		Запрос.УстановитьПараметр("ПериодОстатков", ПериодОстатков);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПериодОстатков", "");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(БонусныйСчетАктуализации) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ НЕ БонусныйСчет В (&МассивБонусныхСчетов)", "");	
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если БонусныйСчетАктуализации = Неопределено Тогда
		СписаниеНачисленийБонусныхСчетов.Загрузить(РезультатЗапроса);
	Иначе
		// заменяем строки для конкретного бонусного счета.
	 	МассивУдаления = СписаниеНачисленийБонусныхСчетов.НайтиСтроки(Новый Структура("БонусныйСчет", БонусныйСчетАктуализации));
		Для Каждого ЭлементМ Из МассивУдаления Цикл
			СписаниеНачисленийБонусныхСчетов.Удалить(ЭлементМ);			
		КонецЦикла;
		
		Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
			ЗаполнитьЗначенияСвойств(СписаниеНачисленийБонусныхСчетов.Добавить(), СтрокаТЗ);			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Процедура, заполняет ТЧ истекшими бонусными счетами.
//
Процедура ЗаполнитьЗакрытиеБонусныхСчетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БонусныеСчета.Ссылка КАК БонусныйСчет,
	|	БонусныеСчета.ВладелецБонусногоСчета КАК Владелец,
	|	ИСТИНА КАК Закрыт
	|ИЗ
	|	Справочник.БонусныеСчета КАК БонусныеСчета
	|ГДЕ
	|	БонусныеСчета.ПометкаУдаления = ЛОЖЬ
	|	И НЕ БонусныеСчета.Закрыт
	|	И НЕ БонусныеСчета.СрокДействияКонец = ДАТАВРЕМЯ(1, 1, 1)
	|	И НАЧАЛОПЕРИОДА(БонусныеСчета.СрокДействияКонец, ДЕНЬ) <= &СрокДействияКонец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.БонусныйСчет,
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.Владелец,
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.Закрыт
	|ИЗ
	|	Документ.ЗакрытиеДня.ЗакрытиеБонусныхСчетов КАК ЗакрытиеДняЗакрытиеБонусныхСчетов
	|ГДЕ
	|	ЗакрытиеДняЗакрытиеБонусныхСчетов.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка"				, Ссылка);			   
	Запрос.УстановитьПараметр("СрокДействияКонец"	, НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())));

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ЗакрытиеБонусныхСчетов.Загрузить(РезультатЗапроса);
	
КонецПроцедуры // ЗаполнитьЗакрытиеЧленствПакетовУслуг

// Процедура, закрывает бонусные счета.
//
Процедура ЗакрытьОтменитьЗакрытиеБонусныхСчетов(РежимЗаписи)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Для Каждого СтрокаТЧ Из ЗакрытиеБонусныхСчетов Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.БонусныйСчет)
					И (РежимЗаписи = РежимЗаписиДокумента.Проведение И СтрокаТЧ.БонусныйСчет.Закрыт <> Истина
						ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И СтрокаТЧ.БонусныйСчет.Закрыт = Истина) Тогда
				БонусныйСчетОбъект = СтрокаТЧ.БонусныйСчет.ПолучитьОбъект();
				БонусныйСчетОбъект.Закрыт = (РежимЗаписи = РежимЗаписиДокумента.Проведение);
				БонусныйСчетОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
